Revit 2027 API
IFCTransformSetter.Initialize Method
 Initializes the transformation in the transform setter.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Initialize(
	ExporterIFC exporterIFC,
	Transform transform
)
Public Sub Initialize (
	exporterIFC As ExporterIFC,
	transform As Transform
)
public:
void Initialize(
	ExporterIFC^ exporterIFC,
	Transform^ transform
)
member Initialize :
        exporterIFC : ExporterIFC *
        transform : Transform -> unit
Parameters
exporterIFC ExporterIFC
 The exporter.
transform Transform
 The transform.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCTransformSetter Class
Autodesk.Revit.DB.IFC Namespace